In [4]:
# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
import pandas as pd
data = [4,8,15,16,23,42]
ser = pd.Series(data)
print(ser)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [10]:
# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.
ser_var = [1,2,3,5,6,7,8,9,10,4]
import pandas as pd
var_ser = pd.Series(ser_var)
print(var_ser)

0     1
1     2
2     3
3     5
4     6
5     7
6     8
7     9
8    10
9     4
dtype: int64

In [20]:
# Q3. Create a Pandas DataFrame that contains the following data:
# Then, print the DataFrame.
import pandas as pd
Data = {'name':['Alice','Bob','Charlie'],'Age':[25,30,27],'Gender':['Female','Male','Female']}
df = pd.DataFrame(Data)
print(df)
type(df)

      name  Age  Gender
0    Alice   25  Female
1      Bob   30    Male
2  Charlie   27  Female

pandas.core.frame.DataFrame

In [ ]:
# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
Ans. 
DataFrame is a two dimensional array where that represent the row and column of the table .DataFrame is refers to that where
the data is in tabular form and it takes the data as like sql and spreadsheat.

A Series is a one-dimensional array where that can hold any data type. It can be thought of as a single column of a DataFrame.
A Series contains both the data values and an associated index, which labels each element of the Series.

In [21]:
# Example of data frame
import pandas as pd
Data = {'name':['Alice','Bob','Charlie'],'Age':[25,30,27],'Gender':['Female','Male','Female']}
df = pd.DataFrame(Data)
print(df)
type(df)

      name  Age  Gender
0    Alice   25  Female
1      Bob   30    Male
2  Charlie   27  Female

pandas.core.frame.DataFrame

In [23]:
# Example of Series
import pandas as pd
Data = {'name':'Alice','Age':30,'Gender':'Female'}
ser = pd.Series(Data)
print(ser)
type(ser)

name       Alice
Age           30
Gender    Female
dtype: object

pandas.core.series.Series

In [ ]:
# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of
# when you might use one of these functions?
There are some common function we can use to manipulate data in a Pandas DataFrame.
1. pd.read_csv
2. pd.read_html
3. pd.read_excel
4. df.head()
5. df.tail()
6. df.dtypes
7. df.columns

In [24]:
import pandas as pd

In [26]:
df = pd.read_csv("class-grades.csv")

In [27]:
df.head()

   Prefix  Assignment  Tutorial  Midterm  TakeHome  Final
0       5       57.14     34.09    64.38     51.48  52.50
1       8       95.05    105.49    67.50     99.07  68.33
2       8       83.70     83.17    30.00     63.15  48.89
3       7       81.22     96.06    49.38    105.93  80.56
4       8       91.32     93.64    95.00    107.41  73.89

In [28]:
df.tail()

    Prefix  Assignment  Tutorial  Midterm  TakeHome  Final
94       8       96.73    103.71    45.00     93.52  61.94
95       7       85.34     80.54    41.25     93.70  39.72
96       8       89.94    102.77    87.50     90.74  87.78
97       7       95.60     76.13    66.25     99.81  85.56
98       8       63.40     97.37    73.12     72.78  77.22

In [29]:
df.dtypes

Prefix          int64
Assignment    float64
Tutorial      float64
Midterm       float64
TakeHome      float64
Final         float64
dtype: object

In [30]:
df.columns

Index(['Prefix', 'Assignment', 'Tutorial', 'Midterm', 'TakeHome', 'Final'], dtype='object')

In [ ]:
# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
Ans.
All Pandas data structures nature are value mutable (can be changed) and except Series all are size mutable.
Series is size immutable and also DataFrame is widely used and one of the most important data structures. Panel
is used much less.

In [32]:
# Q7. Create a DataFrame using multiple Series. Explain with an example.
import pandas as pd
Data = {
       'name':['amit','riya','nitin'],
       'age': [21,20,22],
       'Occupation':['data scientist','frontend developer','Full stack developer']
       }
df = pd.DataFrame(Data)
df

    name  age            Occupation
0   amit   21        data scientist
1   riya   20    frontend developer
2  nitin   22  Full stack developer